BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny87.PIC
        <edc:SFRDef edc:_addr="0x81" edc:access="nn-nnnnn" edc:cname="TCCR1B" edc:impl="0xDF" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="Timer/Counter1 Clock Select bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No Clock Source (Stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Running, No Prescaling" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Running, CLK/8" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Running, CLK/64" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Running, CLK/256" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Running, CLK/1024" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Running, ExtClk Tx Falling Edge" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Running, ExtClk Tx Rising Edge" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM1" edc:desc="Waveform Generation Mode Bits" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES1" edc:desc="Input Capture 1 Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC1" edc:desc="Input Capture 1 Noise Canceler" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x82" edc:access="nn------" edc:cname="TCCR1C" edc:impl="0xC0" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="FOC1B" edc:desc="Timer/Counter1 Force Output Compare for Channel B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC1A" edc:desc="Timer/Counter1 Force Output Compare for Channel A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x83" edc:access="nnnnnnnn" edc:cname="TCCR1D" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="OC1AU" edc:desc="Timer/Counter1 Output Compare U-pin Enable for Channel A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1AV" edc:desc="Timer/Counter1 Output Compare V-pin Enable for Channel A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1AW" edc:desc="Timer/Counter1 Output Compare W-pin Enable for Channel A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1AX" edc:desc="Timer/Counter1 Output Compare X-pin Enable for Channel A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1BU" edc:desc="Timer/Counter1 Output Compare U-pin Enable for Channel B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1BV" edc:desc="Timer/Counter1 Output Compare V-pin Enable for Channel B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1BW" edc:desc="Timer/Counter1 Output Compare W-pin Enable for Channel B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1BX" edc:desc="Timer/Counter1 Output Compare X-pin Enable for Channel B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x84" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x86" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x88" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1A" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x8A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1B" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x8C" edc:offset="0x2A"/>
        <edc:SFRDef edc:_addr="0xB6" edc:access="-nnnn-nn" edc:cname="ASSR" edc:impl="0x7B" edc:nzwidth="0x8" ltx:memberofperipheral="TC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:SFRFieldDef edc:cname="TCR0BUB" edc:desc="Timer/Counter0 Control Register B Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCR0AUB" edc:desc="Timer/Counter0 Control Register A Update Busy" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OCR0AUB" edc:desc="Output Compare Register 0A  Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCN0UB" edc:desc="Timer/Counter0 Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS0" edc:desc="Asynchronous Timer/Counter0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXCLK" edc:desc="Enable External Clock Input" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xB7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xB8" edc:access="nnnnnnnn" edc:cname="USICR" edc:nzwidth="0x8" ltx:memberofperipheral="USI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USI">
              <edc:SFRFieldDef edc:cname="USITC" edc:desc="Toggle Clock Port Pin" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USICLK" edc:desc="Clock Strobe" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USICS" edc:desc="USI Clock Source Select Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="USIWM" edc:desc="USI Wire Mode Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Normal Operation" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Three-Wire Mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Two-Wire Mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Two-Wire Mode Held Low" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USIOIE" edc:desc="Counter Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USISIE" edc:desc="Start Condition Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
