BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny87.PIC
        <edc:SFRDef edc:_addr="0xB9" edc:access="nnnnnnnn" edc:cname="USISR" edc:nzwidth="0x8" ltx:memberofperipheral="USI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USI">
              <edc:SFRFieldDef edc:cname="USICNT" edc:desc="USI Counter Value Bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="USIDC" edc:desc="Data Output Collision" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USIPF" edc:desc="Stop Condition Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USIOIF" edc:desc="Counter Overflow Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USISIF" edc:desc="Start Condition Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBA" edc:access="nnnnnnnn" edc:cname="USIDR" edc:nzwidth="0x8" ltx:memberofperipheral="USI"/>
        <edc:SFRDef edc:_addr="0xBB" edc:access="nnnnnnnn" edc:cname="USIBR" edc:nzwidth="0x8" ltx:memberofperipheral="USI"/>
        <edc:SFRDef edc:_addr="0xBC" edc:access="nnnnnnnn" edc:cname="USIPP" edc:nzwidth="0x8" ltx:memberofperipheral="USI"/>
        <edc:AdjustPoint edc:_addr="0xBD" edc:offset="0xB"/>
        <edc:SFRDef edc:_addr="0xC8" edc:access="nnnnnnnn" edc:cname="LINCR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LCMD" edc:desc="LIN Command and Mode bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="LENA" edc:desc="LIN or UART Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCONF" edc:desc="LIN Configuration bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="LIN13" edc:desc="LIN Standard" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSWRES" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC9" edc:access="nnnnnnnn" edc:cname="LINSIR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LRXOK" edc:desc="Receive Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LTXOK" edc:desc="Transmit Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LIDOK" edc:desc="Identifier Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LERR" edc:desc="Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LBUSY" edc:desc="Busy Signal" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LIDST" edc:desc="Identifier Status bits" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCA" edc:access="----nnnn" edc:cname="LINENIR" edc:impl="0xF" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LENRXOK" edc:desc="Enable Receive Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENTXOK" edc:desc="Enable Transmit Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENIDOK" edc:desc="Enable Identifier Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENERR" edc:desc="Enable Error Interrupt" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCB" edc:access="nnnnnnnn" edc:cname="LINERR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LBERR" edc:desc="Bit Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCERR" edc:desc="Checksum Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LPERR" edc:desc="Parity Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSERR" edc:desc="Synchronization Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFERR" edc:desc="Framing Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LOVERR" edc:desc="Overrun Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LTOERR" edc:desc="Frame Time Out Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LABORT" edc:desc="Abort Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCC" edc:access="n-nnnnnn" edc:cname="LINBTR" edc:impl="0xBF" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LBT" edc:desc="LIN Bit Timing bits" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LDISR" edc:desc="Disable Bit Timing Resynchronization" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCD" edc:access="nnnnnnnn" edc:cname="LINBRRL" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LDIV" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCE" edc:access="----nnnn" edc:cname="LINBRRH" edc:impl="0xF" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LDIV" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCF" edc:access="nnnnnnnn" edc:cname="LINDLR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LRXDL" edc:desc="LIN Receive Data Length bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="LTXDL" edc:desc="LIN Transmit Data Length bits" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD0" edc:access="nnnnnnnn" edc:cname="LINIDR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LID" edc:desc="Identifier bit 5 or Data Length bits" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="LP" edc:desc="Parity bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD1" edc:access="----nnnn" edc:cname="LINSEL" edc:impl="0xF" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="LINUART">
              <edc:SFRFieldDef edc:cname="LINDX" edc:desc="FIFO LIN Data Buffer Index bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="LAINC" edc:desc="Auto Increment of Data Buffer Index (Active Low)" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
